Repository: common-repository/wp-just-ads
Catalog: language/jads-*.po
Languages: el

source: The ads sending was succesfull
el: H δημοσίευση ήταν επιτυχής

source: Price
el: Τιμή

source: Email
el: Ηλ. Ταχ

source: Location
el: Περιοχή

source: Contact Name
el: Όνομα

source: Phone Number
el: Αρ. Τηλ

source: Advertisement
el: Αγγελία

source: Parent Advertisement:
el: Γονική κατηγορία

source: All Advertisements
el: Ολες οι αγγελίες

source: View Advertisement
el: Επισκόπηση Αγγελίας

source: Add New Advertisement
el: Προσθεση Νέα Αγγελία

source: New Advertisement
el: Νέα Αγγελία

source: Edit Advertisement
el: Διορθωσε Αγγελία

source: Update Advertisement
el: Αναβάθμισε Αγγελία

source: Search advertisement
el: Ψάξε για αγγελία

source: No advertisements found
el: Δε βρέθηκαν αγγελίες

source: No advertisements found in Trash
el: Δε βρέθηκαν αγγελίες στον κάδο

source: jads
el: Εφαρμ. αγγελιών

source: Is for storing ads
el: καταχώρηση και εύρεση αγγελιών

source: Category
el: Κατηγορία

source: All Categories
el: Όλες οι κατηγορίες

source: Parent Category
el: Γονική Κατηγορία

source: Parent Category:
el: Γονική κατηγορία

source: New Category Name
el: Όνομα νέας κατηγορίας

source: Add New Category
el: Πρόσθεσε νέα κατηγορία

source: Edit Category
el: Διόρθωση κατηγορίας

source: Update Category
el: Αναβάθμισε κατηγορία

source: Separate categories with commas
el: Χώρισε τις κατηγορίες με κομμά

source: Search categories
el: Ψάξε κατηγορίες

source: Add or remove categories
el: Προσθεση ή αφαίρεσε κατηγορίες

source: Choose from the most used categories
el: Διαλεξε από τις πιο συχνές κατηγορίες

source: More information
el: Πληροφορίες

source: Name
el: Όνομα

source: Phone
el: Τηλέφωνο

source: Ad Title
el: Τίτλος αγγελίας

source: Contact Phone
el: Τηλέφωνο

source: Ad Location
el: Νομός / Περιοχή

source: Contact/Application email (private)
el: Ηλ. Ταχυδρομείο (κρυφό)

source: Ad Price
el: Τιμή

source: Description
el: Περιγραφή

source: Active Categories
el: Ενεργές κατηγορίες

source: New ADS
el: Νέα αγγελία

source: My ADS
el: Οι αγγελίες μου

source: Search
el: Αναζήτηση

source: You are not logged in! Please login and try again...
el: Δεν είστε συνδεδεμένος! Παρακαλώ συνδεθείτε και προσπαθήστε ξανα...
